In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('aug_train.csv')

# 1. How big is the data?

In [4]:
df.shape

(19158, 14)

# 2. How does the data look like?

In [6]:
df.sample(5)

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
7788,9016,city_21,0.624,NaN,Has relevent experience,no_enrollment,Graduate,STEM,4,100-500,Early Stage Startup,never,85,0.0
17102,33311,city_136,0.897,Male,Has relevent experience,no_enrollment,Phd,STEM,>20,100-500,Public Sector,>4,55,0.0
3246,3634,city_83,0.923,Male,Has relevent experience,Full time course,High School,NaN,9,NaN,NaN,1,56,0.0
13616,12325,city_14,0.698,Male,No relevent experience,NaN,Graduate,STEM,2,NaN,NaN,never,4,0.0
12185,18191,city_103,0.920,Male,No relevent experience,Full time course,Graduate,STEM,11,NaN,NaN,never,6,0.0

# 3. What is the data type of cols?

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19158 entries, 0 to 19157
Data columns (total 14 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             19158 non-null  int64
 1   city                    19158 non-null  object
 2   city_development_index  19158 non-null  float64
 3   gender                  14650 non-null  object
 4   relevent_experience     19158 non-null  object
 5   enrolled_university     18772 non-null  object
 6   education_level         18698 non-null  object
 7   major_discipline        16345 non-null  object
 8   experience              19093 non-null  object
 9   company_size            13220 non-null  object
 10  company_type            13018 non-null  object
 11  last_new_job            18735 non-null  object
 12  training_hours          19158 non-null  int64
 13  target                  19158 non-null  float64
dtypes: float64(2), int64(2), object(10)
memory usage: 2.0+ MB

# 4. Are there any missing values?

In [8]:
df.isnull().sum()

enrollee_id                  0
city                         0
city_development_index       0
gender                    4508
relevent_experience          0
enrolled_university        386
education_level            460
major_discipline          2813
experience                  65
company_size              5938
company_type              6140
last_new_job               423
training_hours               0
target                       0
dtype: int64

# 5. How does the data look mathemcatically?

In [9]:
df.describe()

        enrollee_id  city_development_index  training_hours        target
count  19158.000000            19158.000000    19158.000000  19158.000000
mean   16875.358179                0.828848       65.366896      0.249348
std     9616.292592                0.123362       60.058462      0.432647
min        1.000000                0.448000        1.000000      0.000000
25%     8554.250000                0.740000       23.000000      0.000000
50%    16982.500000                0.903000       47.000000      0.000000
75%    25169.750000                0.920000       88.000000      0.000000
max    33380.000000                0.949000      336.000000      1.000000

# 6. Are there duplicate values

In [11]:
df.duplicated().sum()

0

# 7. How is the correlation between cols?

In [18]:
df.corr()['enrollee_id']

enrollee_id               1.000000
city_development_index   -0.040455
training_hours            0.000998
target                    0.049475
Name: enrollee_id, dtype: float64